app/views/gossips/show.html.erb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<body class= "gossip1 jumbotron">
<h2><%=Gossip.find(@id).anonymous_gossiper%></h2> <br>
<h2><%=Gossip.find(@id).title%></h2> <br>
<q><%=Gossip.find(@id).content%></q><br>
<p>Date de création: <%=Gossip.find(@id).created_at%></p>

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."gossip_id" = $1  [["gossip_id", 1]]
---
<p>Nombre de like(s)</p>
<%= Gossip.find(@id).likes.count%>

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 6]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 1]]
---
<p>Nombre de commentaire(s)</p>
<%= Gossip.find(@id).comments.count%>

SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 1]]
---
       </tr>
       <% @gossip.comments.each do |comment|%>