app/controllers/comments_controller.rb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "anonymous_commentor", "gossip_id") VALUES ($1, $2, $3) RETURNING "id"  [["content", "C'est de la merde"], ["anonymous_commentor", "Georges"], ["gossip_id", 6]]
---
  def create
    @gossip = Gossip.find(params[:gossip_id])
    @comments = @gossip.comments.create(comment_params)

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def edit
    @comment = Comment.find(params[:gossip_id])

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "comments" SET "content" = $1 WHERE "comments"."id" = $2  [["content", "C'est de la merde billy"], ["id", 11]]
---
  def update
    @gossip = Gossip.find(params[:id])
    @comment = Comment.find(params[:gossip_id])
    @comment.update(comment_params)