app/controllers/gossips_controller.rb

  def create
    if $curent_user != nil
      @gossip = Gossip.create('title' => params.require(:gossip)[:title],
                      'content' => params.require(:gossip)[:content],
                      'user_id' => User.find_by(name: "#{$curent_user}").id)
---
INSERT INTO "gossips" ("user_id", "title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 11], ["title", "Joe la frite"], ["content", "ergergergerg"], ["created_at", "2018-11-01 14:11:52.167982"], ["updated_at", "2018-11-01 14:11:52.167982"]]
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "bob"], ["LIMIT", 1]]

  def destroy
    if $curent_user != nil
      @gossip = Gossip.find(params[:id])
      if @gossip.user_id == (User.find_by(name: "#{$curent_user}").id)
        @gossip.destroy
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "bob"], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 12]]

  def update
    @gossip = Gossip.find(params[:id])
    @gossip.update(gossip_params)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "gossips" SET "content" = $1, "anonymous_gossiper" = $2, "updated_at" = $3 WHERE "gossips"."id" = $4  [["content", "sfvvfrrrrr contenuffeeefef"], ["anonymous_gossiper", "Joe la frite"], ["updated_at", "2018-10-31 17:25:05.096623"], ["id", 4]]