app/controllers/gossips_controller.rb

  def create
    @gossip = Gossip.create('title' => params.require(:gossip)[:title],
                    'content' => params.require(:gossip)[:content],
                    'anonymous_gossiper' => params.require(:gossip)[:anonymous_gossiper])
---
INSERT INTO "gossips" ("title", "content", "created_at", "updated_at", "anonymous_gossiper") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "eeff"], ["content", "efef"], ["created_at", "2018-10-31 16:40:39.111621"], ["updated_at", "2018-10-31 16:40:39.111621"], ["anonymous_gossiper", "zeefzef"]]