app/controllers/likes_controller.rb

  def create
    @gossip = Gossip.find(params[:gossip_id])
    if $curent_user != nil
      if @gossip.likes.create(user_id: (User.find_by(name: "#{$curent_user}").id))
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
INSERT INTO "likes" ("gossip_id", "user_id") VALUES ($1, $2) RETURNING "id"  [["gossip_id", 16], ["user_id", 11]]
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "bob"], ["LIMIT", 1]]

  def destroy
      @gossip = Gossip.find(params[:gossip_id])
      if @gossip.likes.last.user_id == (User.find_by(name: "#{$curent_user}").id)
        @gossip.likes.where(user_id: (User.find_by(name: "#{$curent_user}").id)).last.destroy
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "bob"], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 48]]