app/controllers/registrations_controller.rb

def create
  @registration = Registration.create(registration_params)
  if Registration.check(@registration)
    @@curent_user = Registration.last.name
---
INSERT INTO "registrations" ("name", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "betbbt"], ["email", ""], ["password", ""], ["created_at", "2018-11-01 13:00:13.298078"], ["updated_at", "2018-11-01 13:00:13.298078"]]
SELECT  "registrations".* FROM "registrations" ORDER BY "registrations"."id" DESC LIMIT $1  [["LIMIT", 1]]