app/controllers/users_controller.rb

INSERT INTO "users" ("email", "name", "password") VALUES ($1, $2, $3) RETURNING "id"  [["email", "tom@aol.fr"], ["name", "tom"], ["password", "tomy"]]
---
  def create
    @user = User.create('name' => params.require(:user)[:name],
                    'email' => params.require(:user)[:email],
                    'password' => params.require(:user)[:password])