app/models/registration.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "rfrfrf"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "bob@aol.fr"], ["LIMIT", 1]]
SELECT  "registrations".* FROM "registrations" ORDER BY "registrations"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def Registration.check(registration)
    if User.find_by(email: "#{registration.email}") == nil
      return false
    end
    if registration.password == User.find_by(email: "#{registration.email}").password
      $curent_user = Registration.last.name